posts/20220116-org-time.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Task Repeaters in Org Mode</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans:wght@400;500;600;700&display=swap" rel="stylesheet">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/posts/20220116-org-time.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/posts/20220116-org-time.html">
<meta property="og:title" content="Task Repeaters in Org Mode">
<meta property="og:description" content="I recently started using org-mode to keep track of a few habits (morning meditation, getting some sunlight and exercise before my morning coffee, etc.) and needed to make use of org-mode&#39;s calendar...">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2022-01-29T00:00:00Z">
<meta property="article:modified_time" content="2025-09-21T16:05:22Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Task Repeaters in Org Mode">
<meta name="twitter:description" content="I recently started using org-mode to keep track of a few habits (morning meditation, getting some sunlight and exercise before my morning coffee, etc.) and needed to make use of org-mode&#39;s calendar...">
</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Task Repeaters in Org Mode</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org13b6080">Background</a></li>
<li><a href="#orgcbea739">Review: Dates, Schedules, and Deadlines in Emacs Org-Mode</a></li>
<li><a href="#org643adf7">Repeat Intervals</a>
<ul>
<li><a href="#org37b659c">Different Types of Repeat Intervals</a>
<ul>
<li><a href="#orgcd4594c">The <code>.+</code> Repeater</a></li>
<li><a href="#orgaf1ec15">The <code>++</code> Repeater</a></li>
</ul>
</li>
<li><a href="#orgb4b4d19">Marking Tasks with Repeaters <code>DONE</code> (For Good)</a></li>
</ul>
</li>
<li><a href="#org3274698">Further Reading</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org13b6080" class="outline-2">
<h2 id="org13b6080">Background</h2>
<div class="outline-text-2" id="text-org13b6080">
<div class="PREVIEW" id="org60cf767">
<p>
I recently started using org-mode to keep track of a few habits (morning
meditation, getting some sunlight and exercise before my morning coffee, etc.)
and needed to make use of org-mode's calendar features to do so. I've previously
set deadlines and scheduled dates for my <code>TODO</code> entries, but have seldom used
repeat intervals. My early attempts ( <code>date +1d</code>) worked fine but required some
extra steps if I ever missed a day. This post discusses the <code>.+</code> and <code>++</code>
-style repeat intervals, which allow more control over what happens when you
complete a task after the scheduled date.
</p>

</div>
</div>
</div>
<div id="outline-container-orgcbea739" class="outline-2">
<h2 id="orgcbea739">Review: Dates, Schedules, and Deadlines in Emacs Org-Mode</h2>
<div class="outline-text-2" id="text-orgcbea739">
<p>
The <a href="https://orgmode.org/manual/Dates-and-Times.html">org-mode manual</a> provides plenty of details on the basics of dates and
times. Here's a quick review:
</p>
<ul class="org-ul">
<li><p>
Add a <b>timestamp</b> with only the date to an org-mode entry with <code>&lt;C-c&gt; .</code>. A
timestamp entry with a <i>time</i> can be added with <code>&lt;C-u&gt;&lt;C-c&gt; .</code>. While there are
<a href="https://orgmode.org/manual/Creating-Timestamps.html">plenty of methods</a> for modifying timestamps after creation, I typically create
the timestamp and then modify it, if needed, with <code>S-LEFT/RIGHT/UP/DOWN</code> to
change the day (forward/back) or whichever element of the timestamp the cursor
is located on (up/down).
</p>

<p>
Another useful timestamp format is <code>&lt;C-c&gt; ! (org-time-stamp-inactive</code>), which
inserts an <i>inactive</i> timestamp (represented with square rather than angled
brackets; e.g. <code>[2022-01-16 Sun]</code> rather than <code>&lt;2022-01-16 Sun&gt;</code>). Inactive
timestamps work the same as active timestamps, except that they do not appear
on the org-agenda.
</p></li>
<li>Two timestamps connected by <code>--</code> make up a <b>range</b>
(e.g. <code>&lt;2022-02-12 Sat&gt;--&lt;2022-01-16 Sun&gt;</code>). A range will appear on the agenda
on the start and stop dates and on all dates in the range.</li>
<li><p>
Add a <b>scheduled</b> date to a headline with <code>&lt;C-c&gt;&lt;C-s&gt;</code> and a <b>deadline</b> with
<code>&lt;C-c&gt;&lt;C-d&gt;</code>. Again, there are <a href="https://orgmode.org/manual/Deadlines-and-Scheduling.html">plenty of details</a> in the manual. Both of these
types of timestamps affect how the timestamp appears in the agenda. In short,
a "scheduled" headline appears on the date of the timestamp and on every day
following until the entry is marked <code>DONE</code>. A "deadline" timestamp on a headline
will start appearing in the agenda <code>org-deadline-warning-days</code> before the
deadline timestamp and will appear daily until it is marked <code>DONE</code>.
</p>

<p>
Conceptually, a "deadline" in org mode comports with the common use of the
word: it is the date when a task is supposed to be finished. The meaning of
"scheduled," on the other hand, specifically refers to the date when a task is
to be started. It is not meant to be used in the sense of "scheduling an
appointment." A regular timestamp is better suited for this use. Recall: a
<i>scheduled</i> headline will appear in the agenda <i>even after the scheduled date</i>,
which is not especially useful for an event (again, like a meeting or
appointment) that occurs <i>on</i> a given date.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org643adf7" class="outline-2">
<h2 id="org643adf7">Repeat Intervals</h2>
<div class="outline-text-2" id="text-org643adf7">
<p>
Org-mode makes it possible to schedule recurring events without manually
specifying each repetition date. There are three key formats for repeated
events. Regardless of the format, the main idea is to add a repetition interval
to the timestamp. A repetition interval combines a number with a unit of time to
specify how often a timestamp/schedule/deadline should be repeated. For example:
</p>
<ul class="org-ul">
<li><code>&lt;2022-01-16 Sun +1d&gt;</code> will repeat daily.</li>
<li><code>&lt;2022-01-29 Sat +5d&gt;</code> will repeat every five days.</li>
<li><code>&lt;2022-01-29 Sat +1y&gt;</code> will repeat yearly.</li>
</ul>

<p>
When specifying repeat intervals, <code>y</code> means "yearly", <code>m</code> means "monthly", <code>w</code> means
"weekly", <code>d</code> means "daily", and <code>h</code> means "hourly." Prepending these values with
<code>+&lt;number&gt;</code> tells how often the event should be repeated.
</p>
</div>
<div id="outline-container-org37b659c" class="outline-3">
<h3 id="org37b659c">Different Types of Repeat Intervals</h3>
<div class="outline-text-3" id="text-org37b659c">
<p>
Here's where I ran into trouble. I scheduled some events as daily "habits." For
example, I wanted to take a walk each morning, so I included the following in my
planner file:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Walk 1000 steps before coffee</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-01-29 Sat&gt;</span>
</pre>
</div>

<p>
The idea was that, each morning, I would take a walk and mark the task as <code>DONE</code>,
at which point the date would advance to the next day. This worked fine for a
while, but eventually I missed a day. Suppose I was supposed to walk on
<code>&lt;2022-01-25 Tue&gt;</code> but, instead, I got up and immediately started working on my
computer. Before I knew it, it was after noon and I'd only walked between the
coffeepot and the computer. But I didn't give up, and I took a morning walk
again on <code>&lt;2022-01-29 Sat&gt;</code>. Here's what happens on <code>&lt;2022-01-29 Sat&gt;</code>:
</p>

<p>
<b>State before marking <code>DONE</code>:</b>
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Walk 1000 steps before coffee</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-01-25 Tue +1d&gt;</span>
</pre>
</div>

<p>
<b>State after marking <code>DONE</code>:</b>
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Walk 1000 steps before coffee</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-01-26 Wed +1d&gt;</span>
<span class="org-org-drawer">:PROPERTIES:</span>
<span class="org-org-special-keyword">:LAST_REPEAT:</span> <span class="org-org-date">[2022-01-29 Sat 09:11]</span>
<span class="org-org-drawer">:END:</span>
- State "DONE"       from "TODO"       <span class="org-org-date">[2022-01-29 Sat 09:11]</span>
</pre>
</div>

<p>
The scheduled date advances by one day, but that day is still in the past. If
I really, <i>really</i> need to account for every day, maybe this is what I want. I
could fill out the rest of the days between 2022-01-25 and 2022-01-29 for the
sake of completeness. But oftentimes, if I don't mark something as done, it's
because <i>I haven't done it</i>. I want to indicate that I completed the task <i>today</i>
and I plan to complete the task again <i>tomorrow</i>.
</p>

<p>
There are two special repeaters for situations like this.
</p>
</div>
<div id="outline-container-orgcd4594c" class="outline-4">
<h4 id="orgcd4594c">The <code>.+</code> Repeater</h4>
<div class="outline-text-4" id="text-orgcd4594c">
<p>
Instead of scheduling with <code>+1d</code>, we can use <code>.+1d</code> to specify that, after we mark a
task <code>DONE</code> it should advance by exactly one day from the date (and time, if the
timestamp includes a time) when we marked it <code>DONE</code>. Let's walk through an
example. Let's say I was supposed to clean the kitchen on Sunday, January 9, and
weekly thereafter. But suppose I didn't get to it until Saturday, January 29.
</p>

<p>
<b>State before marking <code>DONE</code>:</b>
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Clean the Kitchen</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-01-09 Sun .+1w&gt;</span>
</pre>
</div>

<p>
<b>State after marking <code>DONE</code>:</b>
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Clean the Kitchen</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-02-05 Sat .+1w&gt;</span>
<span class="org-org-drawer">:PROPERTIES:</span>
<span class="org-org-special-keyword">:LAST_REPEAT:</span> <span class="org-org-date">[2022-01-29 Sat 09:28]</span>
<span class="org-org-drawer">:END:</span>
- State "DONE"       from "TODO"       <span class="org-org-date">[2022-01-29 Sat 09:28]</span>
</pre>
</div>
<p>
A couple of noteworthy things happened here:
</p>
<ul class="org-ul">
<li>The next scheduled date advanced to a <i>future</i> date one week from the
<code>LAST_REPEAT</code> date.</li>
<li>The next scheduled date did <i>not</i> schedule for the next <i>Sunday</i> but for the date
one week from when it was marked <code>DONE</code>, a Saturday.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf1ec15" class="outline-4">
<h4 id="orgaf1ec15">The <code>++</code> Repeater</h4>
<div class="outline-text-4" id="text-orgaf1ec15">
<p>
The <code>++</code> repeater is very similar to the <code>.+</code> repeater insofar as it will also
advance the scheduled date into the future. However, it will <i>also</i> match the
original scheduled time and day of the week. Here's the previous example,
updated to use the <code>++</code> syntax.
</p>

<p>
<b>State before marking <code>DONE</code>:</b>
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Clean the Kitchen</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-01-09 Sun ++1w&gt;</span>
</pre>
</div>

<p>
<b>State after marking <code>DONE</code>:</b>
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Clean the Kitchen</span>
<span class="org-org-special-keyword">SCHEDULED:</span> <span class="org-org-date">&lt;2022-01-30 Sun ++1w&gt;</span>
<span class="org-org-drawer">:PROPERTIES:</span>
<span class="org-org-special-keyword">:LAST_REPEAT:</span> <span class="org-org-date">[2022-01-29 Sat 09:35]</span>
<span class="org-org-drawer">:END:</span>
- State "DONE"       from "TODO"       <span class="org-org-date">[2022-01-29 Sat 09:35]</span>
</pre>
</div>

<p>
It is now scheduled for the next Sunday (even though that's only one day after
the <code>LAST_REPEAT</code> date). In other words, it will always advance into the future,
but it will match the scheduled day of the week instead of advancing the
scheduled date exactly be the repeat interval.
</p>

<p>
One consequence of this behavior is that the next <code>SCHEDULED</code> date might be less
than the repeater interval in the future relative to the <code>LAST_REPEAT</code> date. For
example, if I schedule cleaning each Sunday, but I don't get to it until
Wednesday one week, the next repeat will still be scheduled for the following
Sunday, only four days later.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb4b4d19" class="outline-3">
<h3 id="orgb4b4d19">Marking Tasks with Repeaters <code>DONE</code> (For Good)</h3>
<div class="outline-text-3" id="text-orgb4b4d19">
<p>
You may want to end a repeated task—stop it from appearing in your agenda and
mark it <code>DONE</code> —without entirely deleting the task. Maybe you want to maintain the
task history or re-activate the task in the future. There are two approaches to
this.
</p>

<ol class="org-ol">
<li>Mark the task as <code>DONE</code> by invoking the <code>org-todo</code> function with the numeric
prefix of <code>-1</code>. You can do this with:
<ul class="org-ul">
<li><code>&lt;C-u&gt; -1 &lt;C-t&gt;</code> or <code>&lt;C--1&gt;&lt;C-t&gt;</code>, or</li>
<li><code>&lt;C-u&gt; org-todo</code> or <code>&lt;C--1&gt; org-todo</code>,
and then changing the state to <code>DONE</code>. (<code>&lt;C--1&gt;</code> means to hold Control and type
<code>-1</code>).</li>
</ul></li>
<li>Deactivate the timestamp. Org will not repeat inactive timestamps. You can do
this by placing the cursor on one of the angle brackets <code>&lt;,&gt;</code> on either side of
the timestamp and pressing the up arrow. This will change the angle brackets
to square brackets, indicating an inactive timestamp.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org3274698" class="outline-2">
<h2 id="org3274698">Further Reading</h2>
<div class="outline-text-2" id="text-org3274698">
<p>
The org-mode manual is the best place to learn more about timestamps, schedules,
and deadlines in general and repeated tasks in particular. Here are some places
to start:
</p>
<ul class="org-ul">
<li><a href="https://orgmode.org/manual/Timestamps.html">Timestamps</a></li>
<li><a href="https://orgmode.org/manual/Repeated-tasks.html">Repeated Tasks</a></li>
<li><a href="https://orgmode.org/manual/Dates-and-Times.html">Dates and Times (Index Page)</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-01-29 Sat 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
